ABOUT = """
<b>📝 Крок 1: Розуміння проблеми та постановка завдань 📝</b>

Перший крок до успішного створення проєкту машинного навчання — це зрозуміти проблему, вирішити де знайти дані та визначити кінцеву мету. Також необхідно дізнатися чи існують готові рішення і, якщо так, чим вони не влаштовують вас або замовника.

<b>🗃️ Крок 2: Збір даних 🗃️</b>

Надзвичайно важливо збирати надійні дані, щоб ваша модель могла знайти правильні закономірності. Якість даних, які ви подаєте у модель, визначатиме, наскільки точна ваша модель. Якщо у вас є неправильні або застарілі дані, ви матимете неправильні результати або прогнози, які не є актуальними. Гарні дані є релевантними, містять дуже мало пропущених і повторюваних значень і добре представляють різноманітні присутні підкатегорії.
Я збирав дані самостійно з найпопулярнішого сайта оголошень в Україні. Мені вдалося зпарсити близько 100 тисяч оголошень про продаж квартир.

<b>📊 Крок 3: Аналіз даних 📊</b>

Моя мета на цьому етапі - зрозуміти слабкі та сильні сторони зібраних даних, виявити помилки тощо.
Я знайшов помилки валюти та поверховсті. Близько 0.5% оголошень мали ціну у гривнях у той час, коли всі інші ціни були у доларах. Це помилка сайту з якого я збирав дані, бо й при перегляді оголошень інколи ціна показується у гривнях, не дивлячись на фільтри пошуку. Помилка поверховсті полягає в тому, що інколи поверх квартири більше за загальну поверховість будинку.

<b>⚙️ Крок 4: Підготовка даних ⚙️</b>

Зазвичай дані, які ми зібрали дуже брудні, їх не можна одразу подавати в модель. Наступний етап у процесі підготовки - як правило найдовший, який складається з багатьох кроків: виправлення помилок, заповнення пропущених даних, виявлення шуму та аномалій, створення нових признаків, анотація, зниження розмірності, зміна типів даних, маштабування. Дуже важко переоцінити важливість підготовки даних, бо цей крок дуже важливий для успіху кінцевої моделі.
По-перше, я видалив колонки с великою кількістю пропущених значень та заповнив пропуски у колонках з малим відсотком пропусків. Потім я перевів гривні у долари за актуальним курсом Google Finance, бо так робить сайт з оголошеннями і виправив проблему поверховості. За допомою різних графіків та квантилів розподілу виявив аномалії та видалив їх. Також я змінив поверх на категоріальну ознаку з варіантами “перший”, “останній” та “не останій і не перший” і закодував усі категоріальні ознаки.

<b>🤖 Крок 5: Моделювання 🤖</b>

Тепер дані повністю підготовлені і прийшов час обрати модель та метрики якості для її оцінки. Інженери машинного навчання не створюють моделі з нуля, потрібно обрати найкращий алгоритм для наявних даних, налаштувати гіперпараметри і найголовніше - багато експерементувати і відстежувати точність передбачень.

<b>5.1. Навчання моделі та підбір гіперпараметрів</b>
Під час навчання ви передаєте підготовлені дані своїй моделі машинного навчання, щоб знаходити закономірності та робити прогнози. Модель навчається на даних, щоб вона могла виконати поставлене завдання.
Після навчання моделі результат не є фінальним, варто налаштувати гіперпараметри. Існує три головних методи перебору параметрів: пошук по сітці, випадковий пошук і байєсівська оптимізація. Я використав байєсівську оптимізацію за допомогою бібліотеки Optuna.

<b>5.2. Оцінка точності моделі</b>

Після навчання вашої моделі потрібно перевірити, як вона працює. Це робиться шляхом тестування точності моделі на раніше невидимих даних. Якщо тестування проводилося на тих самих даних, які використовуються для навчання, ви не отримаєте дійсної оцінки, оскільки модель уже звикла до них і знаходить ті самі закономірності, що й раніше. Це дасть вам непропорційно високу точність.


<b>👨‍💻 Крок 6: Розгортання моделі (Деплой) 👨‍💻</b>

Тепер, коли модель готова, потрібно зробити її доступною для користувачів. Існує багато варіантів як це зробити. Я ж вирішив зробити невеликий вебдодаток та телеграм-бот, які задеплоїв на Amazon Web Services. Для сайту я використовував мікрофреймворк Flask, HTML5, CSS3 та JavaScript. Телеграм-бота я написав за допомогою python бібліотеки aiogram.
"""
